#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mdata.aws_caller_identity.current: Reading...[0m[0m
[0m[1maws_resourceexplorer2_index.index-example5: Refreshing state... [id=arn:aws:resource-explorer-2:us-east-1:199660179115:index/f6033c65-0360-40a9-b32c-7128b428ae3a][0m
[0m[1maws_wafv2_ip_set.ip_set_allow: Refreshing state... [id=86ecb18a-d76d-425f-85ca-3162fc84bb4f][0m
[0m[1mdata.aws_iam_policy_document.github_deployment_oidc_role_policy_document: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.github_deployment_oidc_role_policy_document: Read complete after 0s [id=1789900679][0m
[0m[1mdata.aws_caller_identity.current: Read complete after 0s [id=199660179115][0m
[0m[1mdata.aws_iam_policy_document.github_deployment_oidc_assume_role_policy: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.github_deployment_oidc_assume_role_policy: Read complete after 0s [id=1243534753][0m
[0m[1maws_iam_role.github_deployment_oidc_role: Refreshing state... [id=github-deployment-oidc-role][0m
[0m[1maws_resourceexplorer2_view.view-example5: Refreshing state... [id=arn:aws:resource-explorer-2:us-east-1:199660179115:view/exampleview7/f689085a-25f2-4e42-a8dc-1984a6fc3c63][0m
[0m[1maws_wafv2_web_acl.web_acl_regional: Refreshing state... [id=d484ea1d-3b9c-440a-acba-6a871f1b3fe8][0m
[0m[1maws_iam_role_policy.github_actions_role_policy: Refreshing state... [id=github-deployment-oidc-role:github_deployment_oidc_role_policy][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [31m-[0m destroy[0m

Terraform will perform the following actions:

[1m  # aws_kms_key.cloudtrail-key[0m will be created
[0m  [32m+[0m[0m resource "aws_kms_key" "cloudtrail-key" {
      [32m+[0m[0m arn                                = (known after apply)
      [32m+[0m[0m bypass_policy_lockout_safety_check = false
      [32m+[0m[0m customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      [32m+[0m[0m deletion_window_in_days            = 7
      [32m+[0m[0m description                        = "Cloudtrail log encryption"
      [32m+[0m[0m enable_key_rotation                = false
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m is_enabled                         = true
      [32m+[0m[0m key_id                             = (known after apply)
      [32m+[0m[0m key_usage                          = "ENCRYPT_DECRYPT"
      [32m+[0m[0m multi_region                       = (known after apply)
      [32m+[0m[0m policy                             = (known after apply)
      [32m+[0m[0m tags_all                           = (known after apply)
    }

[1m  # aws_kms_key_policy.kms-key-policy[0m will be created
[0m  [32m+[0m[0m resource "aws_kms_key_policy" "kms-key-policy" {
      [32m+[0m[0m bypass_policy_lockout_safety_check = false
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m key_id                             = (known after apply)
      [32m+[0m[0m policy                             = jsonencode(
            {
              [32m+[0m[0m Id        = "id1"
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = [
                          [32m+[0m[0m "GenerateDataKey*",
                          [32m+[0m[0m "kms:Decrypt",
                        ]
                      [32m+[0m[0m Condition = {
                          [32m+[0m[0m StringEquals = {
                              [32m+[0m[0m "aws:SourceArn" = "arn:aws:cloudtrail:us-east-1:530265417107:trail/niki-trail"
                            }
                          [32m+[0m[0m StringLike   = {
                              [32m+[0m[0m "kms:EncryptionContext:aws:cloudtrail:arn" = "arn:aws:cloudtrail:us-east-1:530265417107:trail/niki-trail/*"
                            }
                        }
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "cloudtrail.amazonaws.com"
                        }
                      [32m+[0m[0m Resource  = "*"
                      [32m+[0m[0m Sid       = "Enable KMS Cloudtrail Permissions"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
    }

[1m  # aws_wafv2_ip_set.ip_set_allow[0m will be [1m[31mdestroyed[0m
  # (because aws_wafv2_ip_set.ip_set_allow is not in configuration)
[0m  [31m-[0m[0m resource "aws_wafv2_ip_set" "ip_set_allow" {
      [31m-[0m[0m addresses          = [
          [31m-[0m[0m "196.244.3.4/32",
        ] [90m-> null[0m[0m
      [31m-[0m[0m arn                = "arn:aws:wafv2:us-east-1:199660179115:regional/ipset/IP-Set/86ecb18a-d76d-425f-85ca-3162fc84bb4f" [90m-> null[0m[0m
      [31m-[0m[0m description        = "IP set" [90m-> null[0m[0m
      [31m-[0m[0m id                 = "86ecb18a-d76d-425f-85ca-3162fc84bb4f" [90m-> null[0m[0m
      [31m-[0m[0m ip_address_version = "IPV4" [90m-> null[0m[0m
      [31m-[0m[0m lock_token         = "b3d2b265-8c6a-4ece-83e0-4a992532b790" [90m-> null[0m[0m
      [31m-[0m[0m name               = "IP-Set" [90m-> null[0m[0m
      [31m-[0m[0m scope              = "REGIONAL" [90m-> null[0m[0m
      [31m-[0m[0m tags               = {
          [31m-[0m[0m "Tag1" = "IP set"
        } [90m-> null[0m[0m
      [31m-[0m[0m tags_all           = {
          [31m-[0m[0m "Tag1" = "IP set"
        } [90m-> null[0m[0m
    }

[1mPlan:[0m 2 to add, 0 to change, 1 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @dtaylor77, Action: `pull_request`, Workflow: `Aquanow Infrastructure DEV Pipeline`*